{
  "basicInfo": {
    "name": "José Valentino",
    "role": "Desarrollador de Software",
    "location": "Puerto Maldonado, Peru",
    "email": "josval.personal@gmail.com",
    "website": "josval.vercel.app",
    "phone": "+51 906 706 357",
    "github": "github.com/josvaal",
    "linkedin": "linkedin.com/in/josval"
  },
  "summary": {
    "content": "Enfocado en soluciones eficientes, desarrollo sistemas modernos, transformando ideas en experiencias sólidas. Me enfoco en la calidad de los sistemas, así optimizando procesos y cuidando cada detalle para garantizar calidad e impacto real."
  },
  "experiences": [
    {
      "id": "6jo81b3",
      "role": "Locador (Informático)",
      "company": "Ministerio Público - Fiscalía de la Nación",
      "startDate": "2025-09",
      "endDate": "2026-12",
      "achievements": [
        "<p>Diseñamos la estructura funcional y la lógica del sistema, definiendo flujos de trabajo y módulos digitales para optimizar la organización interna, presentando la propuesta en reuniones técnicas para su validación institucional.</p>",
        "<p>Desarrollamos en equipo un sistema administrativo para el área de Potencial Humano, orientado a centralizar y agilizar procesos de gestión de personal, asistencia, permisos, licencias, vacaciones, capacitaciones y control documental.</p>"
      ]
    },
    {
      "id": "6xwcfv6",
      "role": "Prácticas preprofesionales",
      "company": "Aukde",
      "startDate": "2025-01",
      "endDate": "2025-04",
      "achievements": [
        "<p>Desarrollé e implementé un RBAC (Control de Acceso Basado en Roles), con validación exhaustiva en todos los puntos de la aplicación, mejorando la eficiencia operativa en un 25% y garantizando un cumplimiento continuo de las políticas internas.</p>",
        "<p>Orquesté la contenerización completa de la arquitectura (todas las capas de la solución y sus herramientas de soporte), estandarizando entornos de desarrollo y producción, y disminuyendo el tiempo de despliegue en un 50%.</p>"
      ]
    },
    {
      "id": "1a79814c-84ed-439b-aabc-4e28571677c9",
      "role": "Desarrollador Web",
      "company": "Aukde",
      "startDate": "2023-01",
      "endDate": "2023-05",
      "current": false,
      "achievements": [
        "<p>Implementé un modelo de control de acceso basado en roles (RBAC) y colaboré en el despliegue de la solución en infraestructura cloud mediante Google Cloud y distribución por CDN, asegurando alta disponibilidad, seguridad y rendimiento en entornos productivos.</p>",
        "<p>Desarrollé e implementé un sistema integral de gestión para clínicas odontológicas, optimizando procesos administrativos, gestión de pacientes, historiales clínicos y control de citas, e incorporando herramientas visuales para el registro y almacenamiento estructurado de reportes y resultados.</p>"
      ]
    },
    {
      "id": "c6fafe21-c01f-414d-abe0-45a17a13d72d",
      "role": "Asistente de Desarrollador Web",
      "company": "Aukde",
      "startDate": "2022-02",
      "endDate": "2022-07",
      "current": false,
      "achievements": [
        "<p>Colaboré en sesiones de planificación y revisión de requisitos con equipos multidisciplinarios, establecí canales de comunicación claros y documenté criterios de aceptación precisos. Esta coordinación mejoró la alineación entre las partes interesadas y permitió entregas más fiables y ajustadas a los objetivos del proyecto, con un impacto positivo en la confianza interna y el seguimiento de plazos.</p>",
        "<p>Gestioné la conexión y el procesamiento de datos provenientes de diversas fuentes externas, optimizando la eficiencia en cada etapa del flujo de información. Como resultado, se logró una reducción del 30 % en los tiempos de carga y una experiencia de navegación notablemente más ágil y fluída.</p>"
      ]
    }
  ],
  "education": [
    {
      "id": "d7f4fe1d-d89f-4584-baf1-e9e2fe5d33bc",
      "degree": "Egresado de Ingeniería de Sistemas e Informática",
      "institute": "Universidad Nacional Amazónica de Madre de Dios",
      "location": "Puerto Maldonado, Perú",
      "startDate": "2021-03",
      "endDate": "2026-01",
      "current": false
    }
  ],
  "skills": [
    {
      "id": "bc928b4c-c911-44ee-a792-34425dfa6c05",
      "title": "Desarrollo Frontend",
      "details": "React, Next.js, Angular, TypeScript, JavaScript ES6+, HTML5, CSS3, SASS/SCSS, Tailwind CSS, Material UI"
    },
    {
      "id": "tlismtt",
      "title": "Desarrollo Backend",
      "details": "NestJS, Express, NodeJS, DJango, Prisma, TypeORM, Redis, RBAC, SQL, NoSQL, Linux"
    },
    {
      "id": "c1be4900-6d8e-4bee-9aee-32e5b15815ec",
      "title": "Diseño UI/UX",
      "details": "Figma, Adobe XD, Responsive Design, Wireframing, Prototyping, User Research"
    },
    {
      "id": "f3fb7f2d-3e46-48db-ac88-0f5fdb836fec",
      "title": "Optimización de Rendimiento",
      "details": "Code Splitting, Lazy Loading, Bundle Analysis, Core Web Vitals, Lighthouse Auditing."
    }
  ],
  "projects": [],
  "activeTheme": "nordic",
  "sectionConfig": {
    "visibility": {
      "basicInfo": true,
      "summary": true,
      "experiences": true,
      "education": true,
      "skills": true,
      "projects": true
    },
    "titles": {
      "summary": "Resumen",
      "experiences": "Experiencia",
      "education": "Educación",
      "skills": "Habilidades",
      "projects": "Proyectos"
    },
    "order": ["summary", "experiences", "education", "skills", "projects"]
  }
}
